Repository: Geuthur/picto_grid_android
Catalog: lib/l10n/app_*.arb
Languages: de

# loadingText
source: Loading pictograms...
de: Piktogramme werden geladen...

# editmodeactiveText
source: Edit mode activated - Click on a box to add pictograms
de: Bearbeitungsmodus aktiviert - Klicken Sie auf ein Feld, um Piktogramme hinzuzufügen

# editmodeinactiveText
source: Edit mode deactivated
de: Bearbeitungsmodus deaktiviert

# activateEditModeText
source: Activate edit mode
de: Bearbeitungsmodus aktivieren

# gridsAvailableText
source: {count} Grid(s) available
de: {count} Grid(s) verfügbar

# chooseGridText
source: Select a grid from the dropdown above
de: Wählen Sie ein Grid aus der Dropdown-Liste oben aus

# profileText
source: Profile: {profilename}
de: Profil: {profilename}

# searchPictoGramPlaceHolder
source: Search pictogram...
de: Piktogramm suchen...

# localPictogramSearchTitle
source: Search local pictograms
de: Lokale Piktogramme suchen

# searchFieldPlaceholder
source: Enter search term
de: Geben Sie einen Suchbegriff ein

# searchFieldNoResults
source: No results found
de: Keine Ergebnisse gefunden

# addPictogramText
source: Add pictogram
de: Piktogramm hinzufügen

# addPictogramContentText
source: How would you like to add a pictogram?
de: Wie möchten Sie ein Piktogramm hinzufügen?

# removePictogramText
source: Remove pictogram
de: Piktogramm entfernen

# editPictogramText
source: Edit pictogram
de: Piktogramm bearbeiten

# namePictogramText
source: Name pictogram
de: Piktogramm benennen

# namePictogramPlaceholder
source: e.g. House, Car, Play...
de: z.B. Haus, Auto, spielen...

# cancelButtonText
source: Cancel
de: Abbrechen

# saveText
source: Save
de: Speichern

# confirmText
source: Confirm
de: Bestätigen

# selectImageFromDeviceTitle
source: Select images from device
de: Bilder vom Gerät auswählen

# selectSingleImageFromDeviceText
source: Select image from device
de: Bild vom Gerät wählen

# takePhotoText
source: Take photo
de: Foto aufnehmen

# takePhotoSubtitleText
source: Take a photo with the camera
de: Mit der Kamera fotografieren

# selectFromGalleryText
source: Select from gallery
de: Aus Galerie auswählen

# descriptionText
source: Description (optional)
de: Beschreibung (optional)

# gridSettingsText
source: Grid Settings
de: Rastereinstellungen

# gridSizeText
source: Grid Size
de: Rastergröße

# showGridLinesText
source: Show grid lines
de: Rasterlinien anzeigen

# languageSettingsText
source: Language Settings
de: Sprache-Einstellungen

# volumeText
source: Volume:
de: Lautstärke:

# speechRateText
source: Speech Rate:
de: Geschwindigkeit:

# resetText
source: Reset Settings
de: Zurücksetzen

# closeText
source: Close
de: Schließen

# deletePictogramText
source: Delete pictogram
de: Piktogramm löschen

# deletePictogramContent
source: Do you really want to remove the pictogram "{keyword}" from the grid?
de: Möchten Sie das Piktogramm "{keyword}" wirklich aus dem Grid entfernen?

# cancelText
source: Cancel
de: Abbrechen

# deleteText
source: Delete
de: Löschen

# removedFromGridText
source: {keyword} has been removed from the grid
de: {keyword} wurde aus dem Grid entfernt

# nameForSpeechLabel
source: Name for speech *
de: Name für Sprachausgabe *

# addedToGridText
source: {keyword} has been added
de: {keyword} wurde hinzugefügt

# infoNoProfile
source: Create a profile first. Then you can add grids and pictograms.
de: Erstellen Sie ein Profil, um loszulegen. Pro Profil können Sie bis zu 3 Grids anlegen.

# infoNoGrid
source: Create a grid for this profile. Then activate the editing mode (✏️) to add pictograms.
de: Erstellen Sie ein Grid für dieses Profil. Aktivieren Sie dann den Bearbeitungsmodus (✏️), um Piktogramme hinzuzufügen.

# infoEditHint
source: Activate the editing mode (✏️) and click on a box to add pictograms.
de: Aktivieren Sie den Bearbeitungsmodus (✏️) und klicken Sie auf ein Kästchen, um Piktogramme hinzuzufügen.

# welcomeText
source: Welcome to the Pictogram App
de: Willkommen bei PictoGrid!

# createProfilePrompt
source: Please create a profile to get started.
de: Erstellen Sie zuerst ein Profil

# createProfileButton
source: Create Profile
de: Neues Profil erstellen

# profileCreated
source: Profile "{name}" has been created
de: Profil "{name}" wurde erstellt

# profileCreateError
source: Error creating profile: {error}
de: Fehler beim Erstellen: {error}

# profileDeleteText
source: Delete Profile
de: Profil löschen

# profileDeleteContent
source: Do you really want to delete the profile "{profile}"?
de: Möchten Sie das Profil "{profile}" wirklich löschen? Alle Grids in diesem Profil werden ebenfalls gelöscht.

# profileDeleteCancel
source: Cancel
de: Abbrechen

# profileDeleteConfirm
source: Delete
de: Löschen

# profileDeleted
source: Profile has been deleted
de: Profil wurde gelöscht

# profileDeleteError
source: Error deleting profile: {error}
de: Fehler beim Löschen: {error}

# noGrids
source: No grids available
de: Noch keine Grids vorhanden

# createFirstGridButton
source: Create First Grid
de: Erstes Grid erstellen

# gridCreated
source: Grid "{name}" has been created
de: Grid "{name}" wurde erstellt

# gridCreateError
source: Error creating grid: {error}
de: Fehler beim Erstellen: {error}

# gridDeleteText
source: Delete Grid
de: Grid löschen

# gridDeleteContent
source: Do you really want to delete the grid "{grid}"?
de: Möchten Sie das Grid "{grid}" wirklich löschen?

# gridDeleteCancel
source: Cancel
de: Abbrechen

# gridDeleteConfirm
source: Delete
de: Löschen

# gridDeleted
source: Grid has been deleted
de: Grid wurde gelöscht

# gridDeleteError
source: Error deleting grid: {error}
de: Fehler beim Löschen: {error}

source: Profile
de: Profil

source: Manage Profiles
de: Profile verwalten

source: New Profile
de: Neues Profil

source: Delete Profile
de: Profil löschen

source: Create New Grid
de: Neues Grid erstellen

# maxGridsReached
source: Maximum {max} grids reached
de: Maximum {max} Grids erreicht

source: Create New Profile
de: Neues Profil erstellen

# prfileName
source: Profile Name
de: Profil-Name

# profileNamePlaceholder
source: like 'My Profile', 'Family'...
de: z.B. Person, Familie, Einrichtung...

# createButtonText
source: Create
de: Erstellen

# gridNamePlaceholder
source: e.g. basic vocabulary, food, activities...
de: z.B. Grundwortschatz, Essen, Aktivitäten...
